src/cf/Documents/РасчетЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>РасчетЗарплаты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отработано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисленно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/РасчетЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТзНачислений = Объект.Начисления.Выгрузить();
	ТзНачислений.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка,
	               |	Сотрудники.Оклад
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	НЕ Сотрудники.Уволен
	               |	И Сотрудники.ДатаПриема < &ДатаДокумента"  ;
				   
	Запрос.УстановитьПараметр("ДатаДокумента",КонецМесяца(Объект.Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоДней = КоличествоРабочихДнейВМесяце();
	Пока Выборка.Следующий() Цикл 
		
		СтрокаНачисления = ТзНачислений.Добавить();
		СтрокаНачисления.Сотрудник 	= Выборка.Ссылка;
		СтрокаНачисления.Отработано = КоличествоРабочихДней;
		СтрокаНачисления.Начисленно = Выборка.Оклад;
		СтрокаНачисления.Оклад		= Выборка.Оклад;
		
	КонецЦикла;	
	
	Объект.Начисления.Загрузить(ТзНачислений);
	
 КонецПроцедуры
 
&НаСервере 
Функция КоличествоРабочихДнейВМесяце()
	
	//TODO Сосновый А.С.
	//Надо считать =)

	Возврат 21;	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоРабочихДней = КоличествоРабочихДнейВМесяце();

	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияОтработаноПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Начисления.ТекущиеДанные;
	
	Если ТекущаяСтрока.Отработано > День(КонецМесяца(Объект.Дата)) тогда
		
		  ТекущаяСтрока.Отработано  = День(КонецМесяца(Объект.Дата));
		  
	КонецЕсли;
	
	ТекущаяСтрока.Начисленно =  ТекущаяСтрока.Отработано / КоличествоРабочихДней * ТекущаяСтрока.Оклад;
КонецПроцедуры
